LEXICON: dict[str, str] = {
    'start': 'Откуда будем собирать конкурентов? 😎',
    'no_text': 'Вы ввели не текст',
    '/help': 'Это бот, для сбора конкурентов в Яндексе\n\n'
             '<u>Доступные команды:</u>\n'
             '/start - запуск сбора конкурентов по вашему ключевому слову\n'
             '/help - краткая инструкция к боту\n'
             '/help_region - помощь по локациям\n\n'
             'Для того, чтобы узнать ваших конкурентов, пройдите 4 простых шага:\n'
             '1. Выберите необходимые данные (Реклама, SEO или Реклама + SEO)\n'
             '2. Введите ключевое слово, по которому искать конкурентов (например: купить забор)\n'
             '3. Укажите регион или город, в котором собираем конкурентов (например: Вологда)\n'
             '4. Скачайте файл в формате xlsx, где будет находиться список ваших конкурентов.\n\n'
             'Важно: Бот собирает информацию в режиме инкогнито. Бот собирает информацию с поиска Яндекса.',
    '/help_region': 'Воспользуйтесь базой регионов ⬇',
    'channel_left': 'Сервис доступен для подписчиков канала\n'
                    '<a href="t.me/ppc_expert_1">КОНТЕКСТНАЯ РЕКЛАМА</a>\n'
                    'Этот сервис собирает информацию о ваших конкурентах в контекстной рекламе Яндекс Директа и '
                    'органической выдаче (SEO) Яндекса. Бот умеет собирать сайты конкурентов, объявления конкурентов '
                    'на поиске. Узнайте ваших конкурентов меньше чем за 1 минуту, без регистраций и оплаты.',
    '^collect^': '✍ Введите ключевую фразу, по которой будем собирать конкурентов (допустимо до 3-х фраз через '
                 'запятую).\n<u>Например: </u><b>заборы для дачи, навес для автомобиля, плитка для двора</b>',
    'region': '📌 Укажите город, область или регион для сбора конкурентов.\n\n'
              '<code>Например город:\n'
              'Москва\n'
              'Екатеринбург\n'
              'Астрахань\n\n'
              'Например область:\n'
              'Москва и область\n'
              'Санкт-Петербург и Ленинградская область\n'
              'Псковская область\n\n'
              'Например регион:\n'
              'Центр\n'
              'Поволжье\n'
              'Сибирь\n\n</code>'
              'Названия локаций соответствуют локациям Яндекс вордстата. Если вы не знаете, как указать нужную локацию, '
              'загляните в меню бота в раздел помощь по локациям',
    'wait': 'Ожидайте, ваш запрос обрабатывается',
    'error_requests': 'Ваш запрос содержит более 3-х ключевых фраз. Запятые должны разделять только разные запросы',
    'error_region': 'Не найдено совпадений введенной Вами локации со списком Яндекс вордстата',
    'result_text': '📝 <b><u>Ваши настройки</u></b>\n\n'
                   '🟢 Откуда собираем: <b><u>{advertising_seo}</u></b>.\n\n'
                   '🔑 Поисковый запрос:\n<b><u>{input_requests}</u></b>.\n\n'
                   '📍 Регион для поиска: <b><u>{input_region}</u></b>',
}

LEXICON_COMMANDS: dict[str, str] = {
    '/start': 'Узнать конкурентов',
    '/help': 'Помощь',
    '/help_region': 'Помощь по локациям'
}


LEXICON_TRANSITION: dict[str, str] = {
    'cancel': '❌ Отмена',
    'next': '🔜 ДАЛЕЕ ➡',
    'next_2': 'Начать ▶️',
    'radio_checked_text': '🟢 {item[0]}',
    'radio_unchecked_text': '⚪️ {item[0]}'
}
